temp1/src/Catalogs/Заказчики/Заказчики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказчики</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Актуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПриоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаЗаказчиков</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУведомлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурирующийМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/Catalogs/Заказчики/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ОбновитьДанныеЗаказчикаВАдреснойКниге;
Перем ОбновитьСловаПоискаПоЗаказчикуВАдреснойКниге;
Перем ОбновитьДанныеОтображенияЗаказчикаВАдреснойКниге;
Перем ОбновитьДоступностьВПоискеПоЗаказчику;

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	РеквизитыКонтрагентаПоСсылке = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Ссылка, "Наименование, ГруппаДоступа, Актуален, ПометкаУдаления, Родитель, КонтактнаяИнформация");
	
	// Обновление адресной книги.
	ОбновитьДанныеЗаказчикаВАдреснойКниге = Ложь;
	ОбновитьДанныеОтображенияЗаказчикаВАдреснойКниге = Ложь;
	ОбновитьСловаПоискаПоЗаказчикуВАдреснойКниге = Ложь;
	ОбновитьДоступностьВПоискеПоЗаказчику = Ложь;
	
	Если ЭтоНовый() Тогда
		ОбновитьДанныеЗаказчикаВАдреснойКниге = Истина;
		Если НЕ ЭтоГруппа Тогда
			ОбновитьСловаПоискаПоЗаказчикуВАдреснойКниге = Истина;
		КонецЕсли;
	Иначе
		Если РеквизитыКонтрагентаПоСсылке.Родитель <> Родитель Тогда
			ОбновитьДанныеЗаказчикаВАдреснойКниге = Истина;
		КонецЕсли;
		Если РеквизитыКонтрагентаПоСсылке.ПометкаУдаления <> ПометкаУдаления ИЛИ РеквизитыКонтрагентаПоСсылке.Актуален <> Актуален Тогда
			ОбновитьДанныеЗаказчикаВАдреснойКниге = Истина;
			ОбновитьДанныеОтображенияЗаказчикаВАдреснойКниге = Истина;
		КонецЕсли;
		Если РеквизитыКонтрагентаПоСсылке.Наименование <> Наименование Тогда
			ОбновитьДанныеОтображенияЗаказчикаВАдреснойКниге = Истина;
			ОбновитьДанныеЗаказчикаВАдреснойКниге = Истина;
		КонецЕсли;
		
		Если НЕ ЭтоГруппа Тогда
			Если РеквизитыКонтрагентаПоСсылке.Наименование <> Наименование Тогда
				ОбновитьСловаПоискаПоЗаказчикуВАдреснойКниге = Истина;
			КонецЕсли;
			Если НЕ ОбновитьСловаПоискаПоЗаказчикуВАдреснойКниге Тогда
				СтараяКонтактнаяИнформация = РеквизитыКонтрагентаПоСсылке.
					КонтактнаяИнформация.Выгрузить().ВыгрузитьКолонку("Представление");
				НоваяКонтактнаяИнформация = КонтактнаяИнформация.Выгрузить().ВыгрузитьКолонку("Представление");
				Для Каждого СтрИнфо ИЗ НоваяКонтактнаяИнформация Цикл
					Если СтараяКонтактнаяИнформация.Найти(СтрИнфо) = Неопределено Тогда
						ОбновитьСловаПоискаПоЗаказчикуВАдреснойКниге = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НЕ ОбновитьСловаПоискаПоЗаказчикуВАдреснойКниге Тогда
					Для Каждого СтрИнфо ИЗ СтараяКонтактнаяИнформация Цикл
						Если НоваяКонтактнаяИнформация.Найти(СтрИнфо) = Неопределено Тогда
							ОбновитьСловаПоискаПоЗаказчикуВАдреснойКниге = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если РеквизитыКонтрагентаПоСсылке.ПометкаУдаления <> ПометкаУдаления Тогда
			ОбновитьДоступностьВПоискеПоЗаказчику = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Обновление адресной книги
	Если ОбновитьДанныеЗаказчикаВАдреснойКниге Тогда
		Справочники.АдреснаяКнига.ОбновитьДанныеОбъекта(
			Ссылка,
			Родитель,
			Справочники.АдреснаяКнига.Заказчики,
			Ссылка);
	КонецЕсли;
	Если ОбновитьДанныеОтображенияЗаказчикаВАдреснойКниге Тогда
		Справочники.АдреснаяКнига.ОбновитьДанныеОтображенияПодчиненногоОбъекта(Ссылка);
	КонецЕсли;
	Если ОбновитьСловаПоискаПоЗаказчикуВАдреснойКниге Тогда
		РегистрыСведений.ПоискВАдреснойКниге.ОбновитьСловаПоискаПоКонтрагенту(ЭтотОбъект);
	КонецЕсли;
	Если ОбновитьДоступностьВПоискеПоЗаказчику Тогда
		РегистрыСведений.ПоискВАдреснойКниге.ОбновитьДоступностьВПоиске(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
